In [6]:
import pandas as pd
import numpy as np

In [7]:
df=pd.read_csv('Salary_Data.csv')
df

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872

In [8]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [9]:
df.tail()

    YearsExperience  Salary
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 612.0 bytes

In [13]:
x=(df['YearsExperience']).sum()
x

159.4

In [14]:
y=(df['Salary']).sum()
y

2280090

In [15]:
xy=(df['YearsExperience']*df['Salary']).sum()
xy

14321961.0

In [17]:
x2=(df['YearsExperience']**2).sum()
x2

1080.5

In [18]:
eex2=(df['YearsExperience'].sum())**2
eex2

25408.36

In [19]:
n=len(df)
n

30

In [21]:
m=n*xy-x*y/n*x2-eex2
m

-12660492473.46

In [22]:
c= y-m*x/n
c

67271696765.650795

In [23]:
y=m*4+c
y

16629726871.810799